---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartHasInvalidGeometry
source: html/d20115ff-dcd9-684e-cbb6-f8229209f0c4.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.FabricationPartHasInvalidGeometry Property

The fabrication part either has no material or has badly configured dimensions, resulting in bad geometry.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricationPartHasInvalidGeometry { get; }
```